In [13]:
import pandas as pd
df = pd.read_csv('C:/Users/ict06/Documents/sd_python/data/korean-idol.csv')
df_rain = pd.read_csv('C:/Users/ict06/Documents/sd_python/data/rain.csv')

# 1. DataFrame 복사, 추가, 삭제
## 1.1. copy (복사)

In [6]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

- 대입연산자

In [7]:
df2 = df
df2.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [8]:
df2['이름'] = 3
df2.head()

   이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0   3  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1   3     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2   3    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3   3  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4   3    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [9]:
df.head()

   이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0   3  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1   3     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2   3    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3   3  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4   3    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [10]:
id(df)

2563664287968

In [11]:
id(df2)

2563664287968

- df.copy()

In [2]:
df = pd.read_csv('data/korean-idol.csv')
copy_df = df.copy()

In [3]:
id(df)

2576610509776

In [4]:
id(copy_df)

2576610601520

In [5]:
copy_df['이름'] = '3'
copy_df.head()

  이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0  3  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  3     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  3    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3  3  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4  3    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [6]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

**연습문제1) copy_df_rain에 df_rain을 복사한 뒤 copy_df_rain의 지역정보를 '제주도'로 일괄변경해서 상위 5개 index만 출력하시오**

In [19]:
copy_df_rain = df_rain.copy()
copy_df_rain['지역'] = '제주도'
copy_df_rain.head()

    지역   요일     강수량  강수확률
0  제주도  월요일   100.0  80.0
1  제주도  화요일    80.0  70.0
2  제주도  수요일  1000.0  90.0
3  제주도  월요일   200.0  10.0
4  제주도  화요일   200.0  20.0

## 1.2. row의 추가

- dictionary 형태의 데이터를 만들어 준다음 **append()** 함수를 사용하여 데이터를 추가
- **ignore_index=True**

In [20]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [21]:
df.columns

Index(['이름', '그룹', '소속사', '성별', '생년월일', '키', '혈액형', '브랜드평판지수'], dtype='object')

In [24]:
df.append({'이름':'앤디', '그룹':'앤디그룹', '소속사':'끝내주는 소속사', '성별':'남', '생년월일':'2000-01-01', '키':180, '혈액형':'O', '브랜드평판지수':2938474},ignore_index=True)

      이름     그룹       소속사  성별        생년월일      키 혈액형   브랜드평판지수
0     지민  방탄소년단       빅히트  남자  1995-10-13  173.6   A  10523260
1   지드래곤     빅뱅        YG  남자  1988-08-18  177.0   A   9916947
2   강다니엘    NaN       커넥트  남자  1996-12-10  180.0   A   8273745
3      뷔  방탄소년단       빅히트  남자  1995-12-30  178.0  AB   8073501
4     화사    마마무       RBW  여자  1995-07-23  162.1   A   7650928
5     정국  방탄소년단       빅히트  남자  1997-09-01  178.0   A   5208335
6     민현   뉴이스트      플레디스  남자  1995-08-09  182.3   O   4989792
7     소연    아이들        큐브  여자  1998-08-26    NaN   B   4668615
8      진  방탄소년단       빅히트  남자  1992-12-04  179.2   O   4570308
9    하성운     핫샷   스타크루이엔티  남자  1994-03-22  167.1   A   4036489
10    태연   소녀시대        SM  여자  1989-03-09    NaN   A   3918661
11   차은우   아스트로      판타지오  남자  1997-03-30  183.0   B   3506027
12    백호   뉴이스트      플레디스  남자  1995-07-21  175.0  AB   3301654
13    JR   뉴이스트      플레디스  남자  1995-06-08  176.0  AB   3274137
14    슈가  방탄소년단       빅히트  남자  1993-03-09  174.0   O   2925442
15    앤디   앤디그룹  끝내주는 소속사   남  2000-01-01  180.0   O   2938474

- append() 한 뒤 다시 df에 대입해줘야 변경한 값이 유지 됩니다.

In [25]:
df.tail()

     이름     그룹   소속사  성별        생년월일      키 혈액형  브랜드평판지수
10   태연   소녀시대    SM  여자  1989-03-09    NaN   A  3918661
11  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
12   백호   뉴이스트  플레디스  남자  1995-07-21  175.0  AB  3301654
13   JR   뉴이스트  플레디스  남자  1995-06-08  176.0  AB  3274137
14   슈가  방탄소년단   빅히트  남자  1993-03-09  174.0   O  2925442

In [26]:
df = df.append({'이름':'앤디', '그룹':'앤디그룹', '소속사':'끝내주는 소속사', '성별':'남', '생년월일':'2000-01-01', '키':180, '혈액형':'O', '브랜드평판지수':2938474},ignore_index=True)

In [27]:
df.tail()

     이름     그룹       소속사  성별        생년월일      키 혈액형  브랜드평판지수
11  차은우   아스트로      판타지오  남자  1997-03-30  183.0   B  3506027
12   백호   뉴이스트      플레디스  남자  1995-07-21  175.0  AB  3301654
13   JR   뉴이스트      플레디스  남자  1995-06-08  176.0  AB  3274137
14   슈가  방탄소년단       빅히트  남자  1993-03-09  174.0   O  2925442
15   앤디   앤디그룹  끝내주는 소속사   남  2000-01-01  180.0   O  2938474

**연습문제3) df_rain에 '제주도','월요일', 200, 40 의 row를 추가하여 마지막 5개의 행만 출력하시오.**

In [29]:
df_rain.columns

Index(['지역', '요일', '강수량', '강수확률'], dtype='object')

In [31]:
df_rain = df_rain.append({'지역':'제주도', '요일':'월요일', '강수량':200, '강수확률':40},ignore_index=True)

In [32]:
df_rain.tail()

     지역   요일    강수량  강수확률
8    부산  화요일  200.0  20.0
9    경기  수요일  100.0  80.0
10   경기  목요일   50.0   NaN
11   경기  금요일  100.0  10.0
12  제주도  월요일  200.0  40.0

## 1.3. column 추가

- 새로운 column을 만들고 값을 대입해주면, 자동으로 생성

In [34]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [35]:
df['국적'] = '대한민국'
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수    국적
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260  대한민국
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947  대한민국
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745  대한민국
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501  대한민국
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928  대한민국

- 만약, 값을 변경하고 싶다면?

In [38]:
df.loc[df['이름']=='지드래곤','국적'] = 'Korea'
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수     국적
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260   대한민국
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947  Korea
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745   대한민국
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501   대한민국
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928   대한민국

# 2. 통계값 다루기

In [40]:
df = pd.read_csv('data/korean-idol.csv')

통계값은 data type이 float나 int형 인 column을 다룹니다

In [41]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   이름       15 non-null     object
 1   그룹       14 non-null     object
 2   소속사      15 non-null     object
 3   성별       15 non-null     object
 4   생년월일     15 non-null     object
 5   키        13 non-null     float64
 6   혈액형      15 non-null     object
 7   브랜드평판지수  15 non-null     int64
dtypes: float64(1), int64(1), object(6)
memory usage: 1.1+ KB

In [43]:
df.describe()

                키       브랜드평판지수
count   13.000000  1.500000e+01
mean   175.792308  5.655856e+06
std      5.820576  2.539068e+06
min    162.100000  2.925442e+06
25%    174.000000  3.712344e+06
50%    177.000000  4.668615e+06
75%    179.200000  7.862214e+06
max    183.000000  1.052326e+07

## 2.1. min(최소값), max(최대값)

통계값은 data type이 float나 int형 인 column을 다룹니다

In [44]:
df['키'].min()

162.1

In [2]:
df[df['키']==df['키'].min()]

   이름   그룹  소속사  성별        생년월일      키 혈액형  브랜드평판지수
4  화사  마마무  RBW  여자  1995-07-23  162.1   A  7650928

In [47]:
df[df['키']==df['키'].max()]

     이름    그룹   소속사  성별        생년월일      키 혈액형  브랜드평판지수
11  차은우  아스트로  판타지오  남자  1997-03-30  183.0   B  3506027

## 2.2. sum (합계), mean (평균)

In [48]:
df['키'].sum()

2285.3

In [49]:
df['키'].mean()

175.7923076923077

In [50]:
df[df['키']>df['키'].mean()]

      이름     그룹   소속사  성별        생년월일      키 혈액형  브랜드평판지수
1   지드래곤     빅뱅    YG  남자  1988-08-18  177.0   A  9916947
2   강다니엘    NaN   커넥트  남자  1996-12-10  180.0   A  8273745
3      뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
5     정국  방탄소년단   빅히트  남자  1997-09-01  178.0   A  5208335
6     민현   뉴이스트  플레디스  남자  1995-08-09  182.3   O  4989792
8      진  방탄소년단   빅히트  남자  1992-12-04  179.2   O  4570308
11   차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
13    JR   뉴이스트  플레디스  남자  1995-06-08  176.0  AB  3274137

## 2.3. var, variance(분산) / std, standard deviation (표준 편차)

* 분산과 표준편차는 데이터가 **평균으로부터 얼마나 떨어져 있는지 정도**를 나타냅니다.
* 분산은 **(데이터 - 평균) ** 2 을 모두 합한 값** / n
* 표준편차는 **분산의 루트**

In [14]:
import numpy as np
arr1 = np.array([1, 3, 5, 7, 9])
arr2 = np.array([3, 4, 5, 6, 7])

In [52]:
arr1.mean()

5.0

In [53]:
arr2.mean()

5.0

In [54]:
# 분산
((1-5)**2 + (3-5)**2 + (5-5)**2 + (7-5)**2 + (9-5)**2 ) / 5  

# 분산 값이 크다는 것은 데이터 간격이 넓게 퍼져있다는 의미
arr1.var(), arr2.var()

(8.0, 2.0)

In [55]:
#표준편차
np.sqrt( ((1-5)**2 + (3-5)**2 + (5-5)**2 + (7-5)**2 + (9-5)**2 ) / 5  )

np.sqrt(arr1.var()), np.sqrt(arr2.var())

(2.8284271247461903, 1.4142135623730951)

In [56]:
arr1.std(), arr2.std()

(2.8284271247461903, 1.4142135623730951)

- pandas에서 var(), std() 함수 제공

In [57]:
df['키'].var()

33.879102564102595

In [58]:
df['키'].std()

5.820575793175672

## 2.4. count()

In [59]:
df['키'].count()

13

## 2.5. 중앙값(median)
- 오름차순으로 정렬한 후 가장 가운데 있는 값

In [60]:
df['키'].median()

177.0

In [62]:
df[df['키']==df['키'].median()]

     이름  그룹 소속사  성별        생년월일      키 혈액형  브랜드평판지수
1  지드래곤  빅뱅  YG  남자  1988-08-18  177.0   A  9916947

## 2.6. 최빈값 (mode)
- 제일 많이 나온 값

In [63]:
df

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수
0     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
1   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947
2   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
4     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
5     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335
6     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792
7     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
8      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
10    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
11   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
12    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
13    JR   뉴이스트     플레디스  남자  1995-06-08  176.0  AB   3274137
14    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442

In [64]:
df['키'].mode()

0    178.0
dtype: float64

**연습문제4) df_rain의 정보를 이용하여 아래 질문에 알맞은 코드를 완성하시오**
- 최소 강수량

In [65]:
df_rain['강수량'].min()

50.0

- 서울 지역의 평균 강수량

In [74]:
df_rain['강수량'].mean()

df_rain[df_rain['지역']=='서울']['강수량'].mean()

307.5

- 강수량 표준편차

In [69]:
df_rain['강수량'].std()

271.9124190550399

- 강수확률 중앙값

In [70]:
df_rain['강수확률'].median()

60.0

- 강수량 최빈값

In [72]:
df_rain['강수량'].mode()

0    100.0
dtype: float64

# 3. pivot_table
- pivot_table은 엑셀의 pivot_table과 동일한 기능.
- 데이터 열 중에서 두 개의 열을 각각 행 인덱스, 열 인덱스로 사용하여 데이터를 조회하여 펼쳐놓은 것을 의미.
- 왼쪽에 나타나는 인덱스를 행 인덱스, 상단에 나타나는 인덱스를 열 인덱스라고 부름.
- pd.pivot_table(df, index='소속사', columns='혈액형', values='키')
- index : 행 인덱스 / columns : 열 인덱스 / values : 조회하고 싶은 값

In [4]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [5]:
pd.pivot(df, index='이름', columns='혈액형', values='키')
df.pivot(index='이름', columns='혈액형', values='키')       # 두개 같은 거

혈액형       A     AB      B      O
이름
JR      NaN  176.0    NaN    NaN
강다니엘  180.0    NaN    NaN    NaN
민현      NaN    NaN    NaN  182.3
백호      NaN  175.0    NaN    NaN
뷔       NaN  178.0    NaN    NaN
소연      NaN    NaN    NaN    NaN
슈가      NaN    NaN    NaN  174.0
정국    178.0    NaN    NaN    NaN
지드래곤  177.0    NaN    NaN    NaN
지민    173.6    NaN    NaN    NaN
진       NaN    NaN    NaN  179.2
차은우     NaN    NaN  183.0    NaN
태연      NaN    NaN    NaN    NaN
하성운   167.1    NaN    NaN    NaN
화사    162.1    NaN    NaN    NaN

In [8]:
# 데이터가 중복되면 Error!!
#df.pivot(index='소속사', columns='혈액형', values='키')

In [10]:
pd.pivot_table(df, index='소속사', columns='혈액형', values='키')

혈액형          A     AB      B      O
소속사
RBW      162.1    NaN    NaN    NaN
YG       177.0    NaN    NaN    NaN
빅히트      175.8  178.0    NaN  176.6
스타크루이엔티  167.1    NaN    NaN    NaN
커넥트      180.0    NaN    NaN    NaN
판타지오       NaN    NaN  183.0    NaN
플레디스       NaN  175.5    NaN  182.3

In [11]:
df.pivot_table(index='소속사', columns='혈액형', values='키', aggfunc='sum')

혈액형          A     AB      B      O
소속사
RBW      162.1    NaN    NaN    NaN
SM         0.0    NaN    NaN    NaN
YG       177.0    NaN    NaN    NaN
빅히트      351.6  178.0    NaN  353.2
스타크루이엔티  167.1    NaN    NaN    NaN
커넥트      180.0    NaN    NaN    NaN
큐브         NaN    NaN    0.0    NaN
판타지오       NaN    NaN  183.0    NaN
플레디스       NaN  351.0    NaN  182.3

In [12]:
import numpy as np

In [13]:
df.pivot_table(index='소속사', columns='혈액형', values='키', aggfunc=np.mean)

혈액형          A     AB      B      O
소속사
RBW      162.1    NaN    NaN    NaN
YG       177.0    NaN    NaN    NaN
빅히트      175.8  178.0    NaN  176.6
스타크루이엔티  167.1    NaN    NaN    NaN
커넥트      180.0    NaN    NaN    NaN
판타지오       NaN    NaN  183.0    NaN
플레디스       NaN  175.5    NaN  182.3

**연습문제5) 소속사별(index)로 성별(colums)에 따른 브랜드평판지수(values)정보를 나타내시오.**

In [14]:
df.pivot_table(index='소속사', columns='성별', values='브랜드평판지수')

성별                 남자         여자
소속사
RBW               NaN  7650928.0
SM                NaN  3918661.0
YG       9.916947e+06        NaN
빅히트      6.260169e+06        NaN
스타크루이엔티  4.036489e+06        NaN
커넥트      8.273745e+06        NaN
큐브                NaN  4668615.0
판타지오     3.506027e+06        NaN
플레디스     3.855194e+06        NaN

# 4. GroupBy

* groupby는 데이터를 **그룹으로 묶어 분석**할 때 활용
* **소속사**별 키의 평균, **성별** 키의 평균 등 특정, 그룹별 통계 및 데이터의 성질을 확인하고자 할 때 활용

In [15]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [16]:
df.groupby('소속사')

groupby와 함께 

* count() - 갯수
* sum() - 합계
* mean() - 평균
* var() - 분산
* std() - 표준편차
* min()/max() - 최소값, 최대값

In [17]:
df.groupby('소속사').count()

         이름  그룹  성별  생년월일  키  혈액형  브랜드평판지수
소속사
RBW       1   1   1     1  1    1        1
SM        1   1   1     1  0    1        1
YG        1   1   1     1  1    1        1
빅히트       5   5   5     5  5    5        5
스타크루이엔티   1   1   1     1  1    1        1
커넥트       1   0   1     1  1    1        1
큐브        1   1   1     1  0    1        1
판타지오      1   1   1     1  1    1        1
플레디스      3   3   3     3  3    3        3

산술 통계는 자동으로 산술통계가 가능한 열만 출력됩니다.

In [18]:
df.groupby('그룹').mean()

                키       브랜드평판지수
그룹
뉴이스트   177.766667  3.855194e+06
마마무    162.100000  7.650928e+06
방탄소년단  176.560000  6.260169e+06
빅뱅     177.000000  9.916947e+06
소녀시대          NaN  3.918661e+06
아스트로   183.000000  3.506027e+06
아이들           NaN  4.668615e+06
핫샷     167.100000  4.036489e+06

In [19]:
df.groupby('성별').sum()

         키   브랜드평판지수
성별
남자  2123.2  68599637
여자   162.1  16238204

특정 열만 출력하고 싶다면?

In [21]:
df.groupby('혈액형')['키'].mean()
# == df.groupby('혈액형').mean()['키']

혈액형
A     172.966667
AB    176.333333
B     183.000000
O     178.500000
Name: 키, dtype: float64

**연습문제6) df_rain에서 지역별 평균 강수량과 강수확률을 나타내시오.**

In [23]:
df_rain.groupby('지역')[['강수량','강수확률']].mean()
# df_rain.groupby('지역').mean()

      강수량  강수확률
지역
경기  130.0  30.0
부산  150.0  20.0
서울  307.5  76.0

# 5. Multi-Index(복합 인덱스)

## 5.1. Multi-Index 적용

행 인덱스를 복합적으로 구성하고 싶은 경우는 인덱스를 리스트로 만들어 줍니다.

In [24]:
df.groupby(['혈액형','성별']).mean()

                 키       브랜드평판지수
혈액형 성별
A   남자  175.140000  7.591755e+06
    여자  162.100000  5.784794e+06
AB  남자  176.333333  4.883097e+06
B   남자  183.000000  3.506027e+06
    여자         NaN  4.668615e+06
O   남자  178.500000  4.161847e+06

In [27]:
df.groupby(['소속사','성별']).mean()

                     키       브랜드평판지수
소속사     성별
RBW     여자  162.100000  7.650928e+06
SM      여자         NaN  3.918661e+06
YG      남자  177.000000  9.916947e+06
빅히트     남자  176.560000  6.260169e+06
스타크루이엔티 남자  167.100000  4.036489e+06
커넥트     남자  180.000000  8.273745e+06
큐브      여자         NaN  4.668615e+06
판타지오    남자  183.000000  3.506027e+06
플레디스    남자  177.766667  3.855194e+06

## 5.2. Multi-Index 데이터 프레임을 피벗 테이블로 변환

Multi-Index로 된 데이터프레임을 피벗테이블 형태로 다시 변환가능

In [46]:
df2 = df.groupby(['혈액형','성별']).mean()
df2

                 키       브랜드평판지수
혈액형 성별
A   남자  175.140000  7.591755e+06
    여자  162.100000  5.784794e+06
AB  남자  176.333333  4.883097e+06
B   남자  183.000000  3.506027e+06
    여자         NaN  4.668615e+06
O   남자  178.500000  4.161847e+06

In [47]:
df2.unstack('성별')

              키              브랜드평판지수
성별           남자     여자            남자         여자
혈액형
A    175.140000  162.1  7.591755e+06  5784794.5
AB   176.333333    NaN  4.883097e+06        NaN
B    183.000000    NaN  3.506027e+06  4668615.0
O    178.500000    NaN  4.161847e+06        NaN

## 5.3. 인덱스 초기화 (reset_index)

reset_index() 는 Multi-Index로 구성된 데이터 프레임의 **인덱스를 초기화**해 줍니다.

In [48]:
df2

                 키       브랜드평판지수
혈액형 성별
A   남자  175.140000  7.591755e+06
    여자  162.100000  5.784794e+06
AB  남자  176.333333  4.883097e+06
B   남자  183.000000  3.506027e+06
    여자         NaN  4.668615e+06
O   남자  178.500000  4.161847e+06

In [49]:
df2 = df2.reset_index()
df2

  혈액형  성별           키       브랜드평판지수
0   A  남자  175.140000  7.591755e+06
1   A  여자  162.100000  5.784794e+06
2  AB  남자  176.333333  4.883097e+06
3   B  남자  183.000000  3.506027e+06
4   B  여자         NaN  4.668615e+06
5   O  남자  178.500000  4.161847e+06